{
  "app.name": "Named Range Wizard",
  "app.home.welcome": "Hi there 👋",
  "app.home.tagline": "What do you want to do today?",
  "app.home.description": "Click on any of the buttons below to feel the magic!",
  "app.function.export": "Export Names",
  "app.function.export.error": "Failed to export named ranges. Please retry again. (Error code: {ERROR_CODE})",
  "app.function.namedRange.tips1": "A named range can be up to 255 characters long and can contain letters, numbers, periods and underscores (no spaces or special punctuation characters).",
  "app.function.namedRange.tips2": "All named ranges must begin with a letter, an underscore \"_\" or a backslash \"\\\".",
  "app.function.namedRange.tips3": "Named ranges can include numbers but cannot include any spaces.",
  "app.function.namedRange.tips4": "You cannot use any named ranges that resemble actual cell addresses (e.g. A$5 or R3C8).",
  "app.function.namedRange.tips5": "You cannot use any symbols except for an underscore and a full stop. It is possible to include a backslash and a question mark as long as they are not the first characters.",
  "app.function.namedRange.tips6": "Named ranges can be just single letters with the exception of the letters R and C.",
  "app.function.namedRange.tips7": "They are case insensitive. You cannot have another named range with the same letters but in a different case.",
  "app.function.add": "Add Names",
  "app.function.add.howTo": "Add the items you wish to add as named range to the table located in \"Add Names Wizard\" worksheet. Some tips for defining a the name of a named range:",
  "app.function.add.error": "Failed to add named ranges. Please retry again. (Error code: {ERROR_CODE})",
  "app.function.add.error.NothingToAdd": "Please add at least one named range, and press \"Retry\" to proceed adding.",
  "app.function.add.error.InvalidInput": "Please correct the below error first, and press \"Retry\" to proceed adding:",
  "app.function.add.error.FailedToAdd": "New named ranges are partially added with the following errors, correct them and and press \"Retry\" to proceed:",
  "app.function.add.error.insertForm": "Failed to insert worksheet use for adding named ranges. (Error code: {ERROR_CODE})",
  "app.function.add.error.missingName": "Missing name for some of the formulas defined.",
  "app.function.add.error.invalidName": "{NAME}: Invalid name",
  "app.function.add.error.missingFormula": "{NAME}: Formula is empty",
  "app.function.add.success": "All the named ranges are added to workbook succesfully.",
  "app.function.edit.howTo": "Add the items you wish to edit to the table located in \"Edit Names Wizard\" worksheet. Some tips for defining a the name of a named range:",
  "app.function.edit.error": "Failed to edit named ranges. Please retry again. (Error code: {ERROR_CODE})",
  "app.function.edit.error.NoExistingNamedRanges": "No existing named ranges found. Please use \"Add Name\" instead.",
  "app.function.edit.error.NothingToEdit": "Please add at least one named range, and press \"Retry\" to proceed editing.",
  "app.function.edit.error.FailedToEdit": "New named ranges are partially added with the following errors: ",
  "app.function.edit.error.insertForm": "Failed to insert worksheet use for editing named ranges. (Error code: {ERROR_CODE})",
  "app.function.edit.error.runtimeError": "Edit {NAME} Failed: {ERROR}",
  "app.function.edit.error.missingFormula": "{NAME}: Formula is empty",
  "app.function.edit.success": "All the named ranges are edited succesfully.",
  "app.function.edit": "Edit Names",
  "app.function.validate": "Validate Names",
  "app.function.validate.error": "Failed to validate named ranges. Please retry again. (Error code: {ERROR_CODE})",
  "app.function.validate.success": "No invalid named ranges found in this workbook. Hurray!",
  "app.function.validate.failed.one": "There is {COUNT} invalid named range found in this workbook:",
  "app.function.validate.failed.other": "There are {COUNT} invalid named ranges found in this workbook:",
  "app.modal.ok": "OK",
  "app.modal.add": "Add",
  "app.modal.edit": "Edit",
  "app.modal.retry": "Retry",
  "app.modal.terminate": "Terminate",
  "app.modal.cancel": "Discard and Close",
  "app.modal.close": "Close",
  "app.error.title": "Unexpected Error"
}
